kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
#include "zigbee_app.h"

#include <errno.h>

#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>

#include <zboss_api.h>
#include <zboss_api_addons.h>
#include <zb_mem_config_med.h>
#include <zigbee/zigbee_app_utils.h>
#include <zigbee/zigbee_error_handler.h>
#include <zb_nrf_platform.h>

#if IS_ENABLED(CONFIG_APP_HW_HFCLK_PROBE)
#include <hal/nrf_clock.h>
#endif

#include "calibration.h"
#include "led_controller.h"
#include "metering_scale.h"
#include "nvs_store.h"
#include "zb_meter_ep.h"

LOG_MODULE_REGISTER(zigbee_app, LOG_LEVEL_INF);

/*
 * Endpoint 10 — same slot the ncs-zigbee samples land clusters on,
 * which makes Z2M's default cluster discovery just work. If we ever
 * grow a second endpoint (e.g. a Power Configuration cluster on its
 * own EP), pick 11 for it and keep this one metering-only.
 */
#define APP_ENDPOINT 10

/*
 * Design-doc defaults for the Metering cluster (see the "Zigbee model"
 * row): Multiplier=1, Divisor=1000 (imp/kWh), UnitOfMeasure=0 (kWh),
 * SummationFormatting=0 (no additional formatting hints — Z2M knows to
 * apply Divisor). MeteringDeviceType=0 = "Electric Metering".
 *
 * The pulse-count-to-kWh math lives in Z2M: kWh = raw_summation ×
 * Multiplier ÷ Divisor. On a 1000 imp/kWh meter the raw summation IS
 * the pulse count, and Divisor=1000 gives Z2M kWh directly. For a
 * different meter (say 800 imp/kWh), overwrite Divisor from Z2M — see
 * `Metering Divisor is runtime-writable` below.
 *
 * Multiplier is pinned to 1 (kept read-only via the stock ZBOSS
 * descriptor macros) and is not persisted. The only tuning knob is
 * Divisor.
 */
#define METERING_MULTIPLIER      1U
#define METERING_DEFAULT_DIVISOR CONFIG_APP_METERING_DEFAULT_IMP_PER_KWH
#define METERING_UNIT_KWH        ZB_ZCL_METERING_UNIT_OF_MEASURE_DEFAULT_VALUE  /* 0 = kWh */
#define METERING_SUMM_FORMATTING 0U
#define METERING_DEVICE_TYPE     0U  /* 0 = Electric Metering per SE 1.4 D.5.2.2.5.2 */

/*
 * Basic-cluster identity strings. These are the fingerprint Z2M's
 * external converter matches on (`zigbeeModel` + manufacturer). Kept
 * short and stable — changing them after commissioning would strand
 * paired coordinators. `SW_BUILD_ID` is a free-form version string
 * — updated by the CI when we start tagging releases; today it
 * mirrors the branch state.
 */
#define BASIC_APP_VERSION      0x01
#define BASIC_STACK_VERSION    0x03  /* ZBOSS R23 */
#define BASIC_HW_VERSION       0x01
#define BASIC_MANUF_NAME       "kwood1992"
#define BASIC_MODEL_ID         "xiao-power-meter"
#define BASIC_DATE_CODE        "20260723"  /* commissioning start — see #5 */
#define BASIC_LOCATION_DESC    ""
#define BASIC_SW_BUILD_ID      "0.5.0"

struct zb_device_ctx {
	zb_zcl_basic_attrs_ext_t basic_attr;
	zb_zcl_identify_attrs_t identify_attr;

	/* Metering (0x0702) attribute storage. Manually broken out
	 * because we want the EXT variant of the ZBOSS attribute-list
	 * macro (adds Multiplier/Divisor) and its bundled struct
	 * `zb_zcl_metering_attrs_t` doesn't include those fields.
	 */
	zb_uint48_t metering_current_summation;
	zb_uint8_t  metering_status;
	zb_uint8_t  metering_unit_of_measure;
	zb_uint8_t  metering_summation_formatting;
	zb_uint8_t  metering_device_type;
	zb_int24_t  metering_instantaneous_demand;
	zb_uint8_t  metering_demand_formatting;
	zb_uint8_t  metering_historical_consumption_formatting;
	zb_uint24_t metering_multiplier;
	zb_uint24_t metering_divisor;
};

static struct zb_device_ctx dev_ctx;

ZB_ZCL_DECLARE_IDENTIFY_ATTRIB_LIST(
	identify_attr_list,
	&dev_ctx.identify_attr.identify_time);

/* EXT variant adds manufacturer name, model ID, hardware/app/stack
 * version, date code, location description, physical environment and
 * software build ID — Z2M's fingerprint match keys off manufacturer
 * name + model ID. Without them the auto-generated definition has
 * `zigbeeModel: ['']` and no external converter can attach.
 */
ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST_EXT(
	basic_attr_list,
	&dev_ctx.basic_attr.zcl_version,
	&dev_ctx.basic_attr.app_version,
	&dev_ctx.basic_attr.stack_version,
	&dev_ctx.basic_attr.hw_version,
	dev_ctx.basic_attr.mf_name,
	dev_ctx.basic_attr.model_id,
	dev_ctx.basic_attr.date_code,
	&dev_ctx.basic_attr.power_source,
	dev_ctx.basic_attr.location_id,
	&dev_ctx.basic_attr.ph_env,
	dev_ctx.basic_attr.sw_ver);

/*
 * Metering Divisor is runtime-writable (issue #48). The stock ZBOSS
 * macro `ZB_ZCL_DECLARE_METERING_ATTRIB_LIST_EXT` declares Divisor as
 * `ZB_ZCL_ATTR_ACCESS_READ_ONLY` (zb_zcl_metering.h:2438-2445), which
 * makes Z2M's attribute-write path return NOT_AUTHORIZED at the ZCL
 * layer — no callback fires, no persistence hook runs. Hand-roll the
 * attribute list so we can flip just Divisor to READ_WRITE using
 * `ZB_ZCL_SET_ATTR_DESC_M`. All other entries reuse the stock
 * descriptors so the access flags for CurrentSummationDelivered et al
 * stay identical to what the ncs-zigbee reference builds ship.
 *
 * Multiplier stays read-only intentionally: keeping the two-variable
 * `kWh = raw × Mult ÷ Div` simple by making only one of them tunable
 * (Divisor == imp/kWh) is a deliberate scope choice — see the issue.
 */
ZB_ZCL_START_DECLARE_ATTRIB_LIST_CLUSTER_REVISION(metering_attr_list,
						  ZB_ZCL_METERING)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID,
			     &dev_ctx.metering_current_summation)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_STATUS_ID,
			     &dev_ctx.metering_status)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_UNIT_OF_MEASURE_ID,
			     &dev_ctx.metering_unit_of_measure)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_SUMMATION_FORMATTING_ID,
			     &dev_ctx.metering_summation_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_METERING_DEVICE_TYPE_ID,
			     &dev_ctx.metering_device_type)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_INSTANTANEOUS_DEMAND_ID,
			     &dev_ctx.metering_instantaneous_demand)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_DEMAND_FORMATTING_ID,
			     &dev_ctx.metering_demand_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_HISTORICAL_CONSUMPTION_FORMATTING_ID,
			     &dev_ctx.metering_historical_consumption_formatting)
	ZB_ZCL_SET_ATTR_DESC(ZB_ZCL_ATTR_METERING_MULTIPLIER_ID,
			     &dev_ctx.metering_multiplier)
	ZB_ZCL_SET_ATTR_DESC_M(ZB_ZCL_ATTR_METERING_DIVISOR_ID,
			       &dev_ctx.metering_divisor,
			       ZB_ZCL_ATTR_TYPE_U24,
			       ZB_ZCL_ATTR_ACCESS_READ_WRITE)
ZB_ZCL_FINISH_DECLARE_ATTRIB_LIST;

ZB_DECLARE_METER_CLUSTER_LIST(
	app_clusters,
	basic_attr_list,
	identify_attr_list,
	metering_attr_list);

ZB_DECLARE_METER_EP(
	app_ep,
	APP_ENDPOINT,
	app_clusters);

ZBOSS_DECLARE_DEVICE_CTX_1_EP(
	app_ctx,
	app_ep);

