kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
#endif /* CONFIG_APP_ZIGBEE_RX_IDLE_PROBE */

/*
 * ZBOSS calls this from its main loop on every stack event.
 *
 * ALWAYS delegate to `zigbee_default_signal_handler` regardless of
 * signal type, then free the buffer. See memory
 * `project_r23_signal_handler_must_delegate.md` for why — skipping
 * the default handler on FIRST_START breaks Z2M's ZDO interview
 * silently. The switch below is just for logging + local `joined`
 * state tracking; no early returns.
 */
void zboss_signal_handler(zb_bufid_t bufid)
{
	zb_zdo_app_signal_hdr_t *sg_p;
	zb_zdo_app_signal_type_t sig = zb_get_app_signal(bufid, &sg_p);
	zb_ret_t status = ZB_GET_APP_SIGNAL_STATUS(bufid);

	switch (sig) {
	case ZB_BDB_SIGNAL_STEERING:
		joined = (status == RET_OK);
		LOG_INF("network steering: %s (status=%d)",
			joined ? "joined" : "failed", status);
		if (joined) {
			rx_idle_probe_kick("post-steering");
		}

		/* Only paint the outcome if a user-initiated join was in
		 * flight — auto-rejoin after ZB_ZDO_SIGNAL_LEAVE fires
		 * the same signal and must stay silent (issue #29).
		 */
		if (atomic_cas(&user_join_in_flight, 1, 0)) {
			led_cancel(LED_PATTERN_JOINING);
			if (status == RET_OK) {
				led_request(LED_PATTERN_JOIN_SUCCESS,
					    LED_PRIO_JOIN_SUCCESS);
			} else {
				led_request(LED_PATTERN_JOIN_FAIL,
					    LED_PRIO_JOIN_FAIL);
			}
		}
		apply_sleepy_poll_intervals_if_joined(status);
		break;

	case ZB_BDB_SIGNAL_DEVICE_REBOOT:
		/* Reboot that re-attached to the saved network in NVRAM (no
		 * fresh steering). Sleepy poll intervals aren't persisted, so
		 * re-apply them here. No LED — there was no user-initiated
		 * join event on this path.
		 */
		if (status == RET_OK) {
			LOG_INF("device reboot: reattached to saved network");
			joined = true;
			rx_idle_probe_kick("post-reboot-reattach");
		}
		apply_sleepy_poll_intervals_if_joined(status);
		break;

	case ZB_ZDO_SIGNAL_LEAVE:
		LOG_WRN("left network");
		joined = false;
		break;

	default:
		break;
	}

	ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));
	if (bufid) {
		zb_buf_free(bufid);
	}
}

static void metering_attrs_init(void)
{
	/* CurrentSummationDelivered — starts at 0; replaced by whatever
	 * NVS persisted before we finish booting, then live-updated as
	 * pulses come in.
	 */
	ZB_ASSIGN_UINT48(dev_ctx.metering_current_summation, 0, 0);

	dev_ctx.metering_status = 0;                 /* no fault flags */
	dev_ctx.metering_unit_of_measure = METERING_UNIT_KWH;
	dev_ctx.metering_summation_formatting = METERING_SUMM_FORMATTING;
	dev_ctx.metering_device_type = METERING_DEVICE_TYPE;

	/* Instantaneous demand — the design doc doesn't publish a live
	 * W/kW figure (HA derives it via the derivative helper). Leave
	 * zero. Demand/historical formatting fields are ignored by Z2M
	 * when the demand attribute isn't reporting, so 0 is safe.
	 * ZB_INT24_FROM_INT32 clamps in-place and needs an l-value.
	 */
	{
		zb_int32_t demand_init = 0;

		ZB_INT24_FROM_INT32(dev_ctx.metering_instantaneous_demand,
				    demand_init);
	}
	dev_ctx.metering_demand_formatting = 0;
	dev_ctx.metering_historical_consumption_formatting = 0;

	/* Multiplier / Divisor. Both are u24 in the wire representation
	 * (packed structs on nRF, low+high halves). Use the ZBOSS
	 * helper that converts a u32 into the packed u24 — writing the
	 * halves by hand is easy to get wrong and the helper is free.
	 *
	 * Multiplier is pinned to 1 (design-doc default; the only tuning
	 * knob is Divisor).
	 *
	 * Divisor comes from NVS if a Z2M write has previously been
	 * persisted; otherwise falls back to the compile-time default.
	 * A value in NVS that has fallen out of range (e.g., a firmware
	 * that used to accept a wider range wrote something we now
	 * reject) is treated the same as no value — surface the fallback
	 * via a warning so the installer notices, but don't refuse to
	 * boot.
	 */
	zb_uint32_to_uint24(METERING_MULTIPLIER, &dev_ctx.metering_multiplier);

	uint32_t divisor = METERING_DEFAULT_DIVISOR;
	uint32_t nvs_val = 0;
	int rc = nvs_store_load_imp_per_kwh(&nvs_val);

	if (rc == 0) {
		if (calibration_is_valid_imp_per_kwh(nvs_val)) {
			divisor = nvs_val;
			LOG_INF("Metering Divisor: imp/kWh=%u (from NVS)",
				(unsigned)divisor);
		} else {
			LOG_WRN("NVS imp/kWh=%u out of range [%u..%u] — "
				"using compile-time default %u",
				(unsigned)nvs_val,
				CALIBRATION_IMP_PER_KWH_MIN,
				CALIBRATION_IMP_PER_KWH_MAX,
				(unsigned)divisor);
		}
	} else if (rc == -ENOENT) {
		LOG_INF("Metering Divisor: imp/kWh=%u (compile-time default; "
			"nothing persisted yet)",
			(unsigned)divisor);
	} else {
		LOG_ERR("nvs_store_load_imp_per_kwh failed: %d — using default %u",
			rc, (unsigned)divisor);
	}

	effective_divisor = divisor;
	zb_uint32_to_uint24(divisor, &dev_ctx.metering_divisor);
}

static void app_clusters_attr_init(void)
{
	/* Basic cluster (0x0000). ZCL_VERSION populated from header;
	 * power source declared as battery — a sleepy ED on AAA
	 * signals its polling model that way, which changes Z2M's
	 * expected report cadence (poll- rather than push-heavy).
	 * Bench-USB power is still declared as battery because that's
	 * the target power model.
	 */
	dev_ctx.basic_attr.zcl_version = ZB_ZCL_VERSION;
	dev_ctx.basic_attr.app_version = BASIC_APP_VERSION;
	dev_ctx.basic_attr.stack_version = BASIC_STACK_VERSION;
	dev_ctx.basic_attr.hw_version = BASIC_HW_VERSION;
	dev_ctx.basic_attr.power_source = ZB_ZCL_BASIC_POWER_SOURCE_BATTERY;
	dev_ctx.basic_attr.ph_env = ZB_ZCL_BASIC_ENV_UNSPECIFIED;

	/* ZCL strings are length-prefixed (Pascal-style): first byte is
	 * the length excluding the terminator. `ZB_ZCL_SET_STRING_VAL`
	 * writes both the prefix and the payload; `ZB_ZCL_STRING_CONST_SIZE`
	 * is the compile-time strlen minus trailing NUL.
	 */
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.mf_name,
			      BASIC_MANUF_NAME,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_MANUF_NAME));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.model_id,
			      BASIC_MODEL_ID,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_MODEL_ID));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.date_code,
			      BASIC_DATE_CODE,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_DATE_CODE));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.location_id,
			      BASIC_LOCATION_DESC,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_LOCATION_DESC));
	ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.sw_ver,
			      BASIC_SW_BUILD_ID,
			      ZB_ZCL_STRING_CONST_SIZE(BASIC_SW_BUILD_ID));

	/* Identify cluster (0x0003). Default identify time = 0 =
	 * device is NOT currently identifying.
	 */
	dev_ctx.identify_attr.identify_time =
		ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

	metering_attrs_init();
}

