kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
/*
 * ZCL device callback — invoked by ZBOSS post-write, after the
 * incoming attribute value has already been written into
 * `dev_ctx.metering_divisor`. If we reject, ZBOSS uses `p->status`
 * as the ZCL response; the attribute-table update is our problem to
 * undo (see the rollback path below).
 *
 * Scope: this handler is a filter for one attribute (Metering.Divisor)
 * and quietly RET_OK's every other invocation so cluster machinery
 * that ZBOSS drives through the same callback (identify effects, etc.)
 * still works. Other paths that want to hook this callback in future
 * should extend the switch here rather than replacing it.
 */
static void zcl_device_cb(zb_bufid_t bufid)
{
	zb_zcl_device_callback_param_t *p =
		ZB_BUF_GET_PARAM(bufid, zb_zcl_device_callback_param_t);

	p->status = RET_OK;

	if (p->device_cb_id != ZB_ZCL_SET_ATTR_VALUE_CB_ID) {
		return;
	}
	if (p->cb_param.set_attr_value_param.cluster_id !=
	    ZB_ZCL_CLUSTER_ID_METERING) {
		return;
	}
	if (p->cb_param.set_attr_value_param.attr_id !=
	    ZB_ZCL_ATTR_METERING_DIVISOR_ID) {
		return;
	}

	/* zb_uint24_t on the target is a packed {u16 low, u8 high}
	 * struct (zb_types.h:1011). Rebuild the u32 by hand — the
	 * ZBOSS helper only goes the other way (u32→u24).
	 */
	zb_uint24_t v24 = p->cb_param.set_attr_value_param.values.data24;
	uint32_t new_divisor = ((uint32_t)v24.high << 16) | v24.low;

	if (!calibration_is_valid_imp_per_kwh(new_divisor)) {
		LOG_WRN("rejecting Metering Divisor write: %u out of range "
			"[%u..%u] — rolling back to %u",
			(unsigned)new_divisor,
			CALIBRATION_IMP_PER_KWH_MIN,
			CALIBRATION_IMP_PER_KWH_MAX,
			(unsigned)effective_divisor);

		/* ZBOSS already committed the bad value to the attribute
		 * store; put the previously-effective value back so a
		 * follow-up Z2M read returns the still-valid Divisor.
		 * ZB_FALSE bypasses the access-flag check (we're the app,
		 * we own this attribute).
		 */
		zb_uint24_t rollback;

		zb_uint32_to_uint24(effective_divisor, &rollback);
		ZB_ZCL_SET_ATTRIBUTE(APP_ENDPOINT,
				     ZB_ZCL_CLUSTER_ID_METERING,
				     ZB_ZCL_CLUSTER_SERVER_ROLE,
				     ZB_ZCL_ATTR_METERING_DIVISOR_ID,
				     (zb_uint8_t *)&rollback,
				     ZB_FALSE);
		p->status = RET_OUT_OF_RANGE;
		return;
	}

	int rc = nvs_store_save_imp_per_kwh(new_divisor);

	if (rc) {
		/* Persist failed — keep the write in memory anyway. Losing
		 * the value on next reboot is a worse outcome than
		 * refusing a valid write; the installer will notice next
		 * boot when the value snaps back to the compile-time
		 * default.
		 */
		LOG_ERR("nvs_store_save_imp_per_kwh(%u) failed: %d — "
			"value applied in memory only",
			(unsigned)new_divisor, rc);
	} else {
		LOG_INF("Metering Divisor updated: imp/kWh=%u (persisted)",
			(unsigned)new_divisor);
	}

	effective_divisor = new_divisor;
}

int zigbee_app_init(void)
{
	/* Register the endpoint context BEFORE zigbee_enable(). Without
	 * this, ZBOSS has no clusters to advertise during commissioning
	 * and bdb_start_top_level_commissioning() asserts — see #4's
	 * notes for the exact failure signature.
	 */
	ZB_ZCL_REGISTER_DEVICE_CB(zcl_device_cb);
	ZB_AF_REGISTER_DEVICE_CTX(&app_ctx);
	app_clusters_attr_init();
	endpoint_registered = true;

	/*
	 * Sleepy-ED behaviour (issue #8 blocker 1).
	 *
	 * CONFIG_ZIGBEE_ROLE_END_DEVICE fixes the MAC-layer role;
	 * zb_set_rx_on_when_idle() (called via zigbee_configure_sleepy_behavior)
	 * is the runtime flag that actually gates whether the radio sleeps
	 * between parent polls. rx-on-when-idle=TRUE burns ~5 mA average —
	 * a non-starter for the AAA target — so we default to sleepy=true
	 * and cover Z2M's interview deadline with a turbo-poll window
	 * (see zboss_signal_handler for ZB_BDB_SIGNAL_STEERING).
	 *
	 * dev.conf can flip APP_ZIGBEE_SLEEPY_ED=n as an escape hatch if the
	 * turbo-poll window ever fails to cover a slow Z2M read — that path
	 * is what the previous USB-dev build used unconditionally.
	 *
	 * ed_timeout / keepalive_timeout come from the R23 light_switch
	 * reference sample (samples/light_switch/src/main.c:837-838). Without
	 * a large aging timeout, the parent evicts a sleepy child before the
	 * next long-poll cycle — the practical failure mode is a device that
	 * joins once, drops off after ~7.5 s (ZB_TIME_ED_IDLE default), and
	 * never rejoins because it never wakes.
	 */
	if (IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED)) {
		zb_set_ed_timeout(ED_AGING_TIMEOUT_64MIN);
		zb_set_keepalive_timeout(
			ZB_MILLISECONDS_TO_BEACON_INTERVAL(30000));
	}
	zigbee_configure_sleepy_behavior(IS_ENABLED(CONFIG_APP_ZIGBEE_SLEEPY_ED));
	rx_idle_probe_kick("post-configure-sleepy");

	zigbee_enable();
	return 0;
}

/* Callbacks that talk to ZBOSS API must run on the ZBOSS thread — see
 * the equivalent comment in the join/reset flow.
 */
static void start_steering_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	LOG_INF("ZBOSS thread: invoking bdb_start_top_level_commissioning");
	zb_bool_t rc = bdb_start_top_level_commissioning(ZB_BDB_NETWORK_STEERING);

	LOG_INF("ZBOSS thread: bdb_start returned %s",
		rc == ZB_TRUE ? "TRUE (scheduled)" : "FALSE (rejected)");
}

static void factory_reset_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);
	LOG_WRN("ZBOSS thread: invoking zb_bdb_reset_via_local_action");
	joined = false;
	zb_bdb_reset_via_local_action(0);
}

/*
 * Trampoline that runs on the ZBOSS thread and does the actual
 * `ZB_ZCL_SET_ATTRIBUTE` call. The publish API packs the pulse total
 * into a scheduler-callback-sized u8 index via a shadow variable —
 * `param` is only 8 bits so we can't pass the 48-bit summation
 * through it directly.
 */
static uint64_t pending_summation_total;

static void write_summation_attribute(uint64_t pulse_total)
{
	struct metering_u48 v = metering_scale_to_u48(pulse_total);
	zb_uint48_t summation;

	ZB_ASSIGN_UINT48(summation, v.high, v.low);

	/* Persist into the attribute table AND mark for reporting.
	 * `ZB_FALSE` on check_access means the write skips the ZCL
	 * read-only access check — required because the summation
	 * attribute is declared read-only (external writers must go
	 * through the ZCL API, but on-device app code goes direct).
	 */
	ZB_ZCL_SET_ATTRIBUTE(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_METERING,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID,
		(zb_uint8_t *)&summation,
		ZB_FALSE);
}

