kwood1992/nRF52840-power-meter/seeed-studio-zigbee-energy-meter/src/zigbee_app.c
/*
 * Explicit ZCL Report Attributes frame for CurrentSummationDelivered.
 * Runs on the ZBOSS thread. Bypasses the reporting engine's delta gate
 * — see the zigbee_app.h comment on publish_summation_and_report for
 * the rationale (issue #20).
 *
 * Two failure modes we intentionally log but recover from:
 *   * No reporting slot for the attribute yet — coordinator hasn't
 *     sent ConfigureReporting since our last join, or we booted before
 *     Z2M finished interviewing. Frame can't be built without a
 *     destination; skip and let the reporting engine try again next
 *     tick.
 *   * No free OUT buffer. ZBOSS's buffer pool is small; a report on
 *     top of an already-pending report can transiently starve. Skip
 *     and rely on the next tick.
 */
static void send_explicit_summation_report(void)
{
	zb_zcl_reporting_info_t *rep_info = zb_zcl_find_reporting_info(
		APP_ENDPOINT,
		ZB_ZCL_CLUSTER_ID_METERING,
		ZB_ZCL_CLUSTER_SERVER_ROLE,
		ZB_ZCL_ATTR_METERING_CURRENT_SUMMATION_DELIVERED_ID);

	if (rep_info == NULL) {
		LOG_WRN("no reporting slot for CurrentSummationDelivered — "
			"coordinator ConfigureReporting not seen yet");
		return;
	}

	LOG_INF("reporting slot: min_interval=%us max_interval=%us "
		"reportable_change=0x%04x%08x",
		rep_info->u.send_info.min_interval,
		rep_info->u.send_info.max_interval,
		rep_info->u.send_info.delta.u48.high,
		rep_info->u.send_info.delta.u48.low);

	zb_bufid_t bufid = zb_buf_get_out();

	if (bufid == 0) {
		LOG_WRN("no free OUT buffer for explicit summation report");
		return;
	}

	zb_zcl_send_report_attr_command(rep_info, bufid);
}

static void publish_summation_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);

	write_summation_attribute(pending_summation_total);
}

static void publish_summation_and_report_cb(zb_uint8_t param)
{
	ARG_UNUSED(param);

	write_summation_attribute(pending_summation_total);
	send_explicit_summation_report();
}

void zigbee_app_start_join(void)
{
	LOG_INF("starting network steering");
	/* Mark this steering as user-initiated so the signal handler
	 * paints the outcome (see zboss_signal_handler). The blue-blink
	 * request goes in here so the LED shows intent immediately —
	 * a stack-internal steering that hasn't been requested by the
	 * app never sets this flag and never asks for the LED.
	 */
	atomic_set(&user_join_in_flight, 1);
	led_request(LED_PATTERN_JOINING, LED_PRIO_JOINING);
	ZB_SCHEDULE_APP_CALLBACK(start_steering_cb, 0);
}

void zigbee_app_factory_reset(void)
{
	LOG_WRN("factory reset — leaving network and erasing NVS");
	ZB_SCHEDULE_APP_CALLBACK(factory_reset_cb, 0);
}

bool zigbee_app_is_joined(void)
{
	return joined;
}

void zigbee_app_publish_summation(uint64_t pulse_total)
{
	if (!endpoint_registered) {
		/* zigbee_app_init() failed or hasn't run yet — nothing
		 * to publish into. Silent no-op keeps main.c's sample
		 * loop from having to gate its call site on Zigbee
		 * bring-up state.
		 */
		return;
	}

	/* Hand off to the ZBOSS thread. `pending_summation_total` is
	 * a single-writer/single-reader shadow, and back-to-back calls
	 * will collapse into whichever value the ZBOSS thread reads
	 * last — that's actually the behaviour we want (report the
	 * freshest total, not a queue of stale ones).
	 */
	pending_summation_total = pulse_total;
	ZB_SCHEDULE_APP_CALLBACK(publish_summation_cb, 0);
}

void zigbee_app_publish_summation_and_report(uint64_t pulse_total)
{
	if (!endpoint_registered) {
		return;
	}

	pending_summation_total = pulse_total;
	ZB_SCHEDULE_APP_CALLBACK(publish_summation_and_report_cb, 0);
}
